---
kind: enumMember
id: F:Autodesk.Revit.DB.OrdinateDimensionLineStyle.None
enum: Autodesk.Revit.DB.OrdinateDimensionLineStyle
source: html/6051744a-13fa-3a9d-d23b-07b2d29f87f4.htm
---
# Autodesk.Revit.DB.OrdinateDimensionLineStyle.None

Shows no dimension line. When you select the dimension line in the drawing area, a hidden line displays.